In [1]:
import pandas as pd
import numpy as np

# 숫자 표현 e+ 안나오게하기
pd.set_option('display.float_format', '{:.2f}'.format)

In [2]:
df = pd.read_csv("19.12.03_gis건물_일반집합_merge_정제 전.csv", encoding = "CP949")
df.head(1)

                             A0                     A1   A36 a0_2  a1_2  a36_2
0  1995164410394391683600000000 2811011800100879872.00 58.00  NaN   nan    nan

In [3]:
a = df.iloc[:, :3]
b = df.iloc[:, 3:]
a.head(1)
b.head(1)

  a0_2  a1_2  a36_2
0  NaN   nan    nan

In [4]:
a2 = a.dropna(axis = 0)
b2 = b.dropna(axis = 0)

In [5]:
print(a2.shape)
a2.head(1)

(754, 3)

                             A0                     A1   A36
0  1995164410394391683600000000 2811011800100879872.00 58.00

In [6]:
print(b2.shape)
b2.head(1)

(2044, 3)

                             a0_2                   a1_2  a36_2
754  1992171768744357776900000000 2818510300105350144.00 101.00

In [7]:
a2.rename(columns = {
    'A0' : '건물식별번호',
    'A1' : '고유번호',
    'A36' : '주차면수'
}, inplace = True)

b2.rename(columns = {
    'a0_2' : '건물식별번호',
    'a1_2' : '고유번호',
    'a36_2' : '주차면수'
}, inplace = True)

C:\Users\USER\Anaconda3\lib\site-packages\pandas\core\frame.py:4025: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  return super(DataFrame, self).rename(**kwargs)

In [8]:
a2.head(1)

                         건물식별번호                   고유번호  주차면수
0  1995164410394391683600000000 2811011800100879872.00 58.00

In [9]:
b2.head(1)

                           건물식별번호                   고유번호   주차면수
754  1992171768744357776900000000 2818510300105350144.00 101.00

In [10]:
c = pd.concat([a2,b2])
c.index = range(len(c))
print(c.shape)
c.tail(1)

(2798, 3)

                            건물식별번호                   고유번호   주차면수
2797  1992171766254357515900000000 2818510300105350144.00 101.00

In [11]:
c['고유번호'] =  list(map ( lambda x : int(x), c['고유번호']))
c['고유번호'] =  list(map ( lambda x : str(x), c['고유번호']))
print(c.shape)
c.tail(1)

(2798, 3)

                            건물식별번호                 고유번호   주차면수
2797  1992171766254357515900000000  2818510300105350144 101.00

In [12]:
type(c['고유번호'][0])

str

In [14]:
#c.to_csv("19.12.03_gis건물_일반집합_merge_정제 후.csv", encoding = "CP949", index = False)